### Introdução ao Pandas II

In [2]:
# Importando a biblioteca do Pandas
import pandas as pd

# Mapeando o caminho e arquivo
path = 'C:\\Users\\FIC\\Documents\\david_python\\'
file = 'bank-full.xlsx'

# Abrindo o documento do excel, com a sheet selecionada e definindo o dataframe
df = pd.read_excel(path + file, sheet_name= 'Sheet 1 - bank-full')

# Visualizando o cabeçalho do dataframe
df.head()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome
0,58,management,married,tertiary,no,2143,yes,no,unknown,5,may,261,1,-1,0,unknown
1,44,technician,single,secondary,no,29,yes,no,unknown,5,may,151,1,-1,0,unknown
2,33,entrepreneur,married,secondary,no,2,yes,yes,unknown,5,may,76,1,-1,0,unknown
3,47,blue-collar,married,unknown,no,1506,yes,no,unknown,5,may,92,1,-1,0,unknown
4,33,unknown,single,unknown,no,1,no,no,unknown,5,may,198,1,-1,0,unknown

## Media (mean)

In [3]:
# Calculo da média dos valores do campo balance
media = df['balance'].mean()

# A função round trata valores, ajustando o numero de casas decimais
# round (number, number_of_digits)
round(media,2)

1362.38

Calculando a média de mais de uma coluna

In [4]:
# Para selecionar mais de uma coluna, você deve passar uma lista cotendo os nomes das colunas do datafram --> Exemplo: dataframe[[valor1, valor2]]

round(df[['balance', 'duration']].mean(),0)

balance     1362.0
duration     258.0
dtype: float64

## Soma (sum)

In [5]:
df.balance.sum()

61598595

In [6]:
df.duration.sum()

11672894

In [7]:
df[['pdays','duration','balance']].sum()

pdays        1817948
duration    11672894
balance     61598595
dtype: int64

## Unique e Nunique

Unique - Nos mostra todos os valores únicos de uma coluna

Nunique - Nos mostra a quantidade de elementos únicos em uma coluna

In [8]:
# Comando unique

df.job.unique()

array(['management', 'technician', 'entrepreneur', 'blue-collar',
       'unknown', 'retired', 'admin.', 'services', 'self-employed',
       'unemployed', 'housemaid', 'student'], dtype=object)

In [9]:
# Comando nunique

df.job.nunique()

12

## Dados Duplicados

A quantidade de elementos duplicados em coluna

In [10]:
df.job.duplicated().sum()

45202

A quantidade de elementos duplicados em uma tabela

In [11]:
df.duplicated().sum()

3

Identificar os valores duplicados

In [12]:
df.loc[df.duplicated()==True]

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome
45211,37,entrepreneur,married,secondary,no,2971,no,no,cellular,17,nov,361,2,188,11,other
45212,37,entrepreneur,married,secondary,no,2971,no,no,cellular,17,nov,361,2,188,11,other
45213,37,entrepreneur,married,secondary,no,2971,no,no,cellular,17,nov,361,2,188,11,other

### Dados nulos e faltantes

Pd.isna() --> ""

pd.isnull() --> Nula. É a celula que nunca recebeu informação.

In [14]:
# Motrar quais celulas contém uma informação nula ou não nula
df.isnull()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome
0,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
45209,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
45210,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
45211,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
45212,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
45213,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False

In [17]:
# A quantidade de informações nulas existentes no dataframe

df.isnull().sum()

age          0
job          0
marital      0
education    0
default      0
balance      0
housing      0
loan         0
contact      0
day          0
month        0
duration     0
campaign     0
pdays        0
previous     0
poutcome     0
dtype: int64

### Excluir informações Nulas ou Faltantes

In [18]:
df_3 = df.dropna()

### Substituir dados nulos ou faltantes em Dataframe